Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: - Well, I' m not a nun.
ru: - Кстати, я не монашка.

source: - Thank God!
ru: - Слава богу!

source: I mean, that' s great.
ru: Я хочу сказать, это просто великолепно.

source: Is Kofi Evans and Raymont Bennet in your class?
ru: Кофи Эванс и Рэймонд Бэннет в вашем классе?

source: Are they in my class.
ru: В моём ли они классе.

source: Yes, they' re in my class.
ru: Да, они в моём классе.

source: I need them to play baseball for the Kekambas.
ru: Мне нужно, чтобы они играли в Кекамбас.

source: That' s something you should take up with their mothers.
ru: Это то, что вам следует обсудить с их матерями.

source: - But the kids told me -- - Both mothers agreed... the boys would read one book before they start baseball in the spring.
ru: - Но дети мне сказали -- - Обе матери согласны... мальчики должны прочитать по одной книге, до того как они станут тренироваться.

source: Hey, I got no problem with that.
ru: Эй, я не вижу в этом проблемы.

source: You know, I think reading' s real good for kids.
ru: Вы знаете, я думаю, что чтение полезно для детей.

source: You work for Smyth and Stevens Securities?
ru: Вы работаете на Смит энд Стивенс Секьюрити?

source: - What deal did you blow?
ru: - Что за сделку вы заключили?

source: Well, I' m sure you' re not coaching this team by choice.
ru: Ну, я думаю, что вы стали тренировать эту команду не по своей воле.

source: My associate, James Fleming, is in New York for three weeks... so I volunteered to help out.
ru: Я заменяю Джеймса Флеминга, пока он будет в Нью Йорке, в течении трёх недель...

source: I would have loved to have coached that team.
ru: Мне нравится тренировать эту команду.

source: I was away on business -- Canada -- the day Mr. Smyth and Mr. Stevens chose the team.
ru: Мистер Смит и мистер Стивенс выбрали эту команду.

source: Canada.
ru: Канада.

source: That must have been nice.
ru: Это должно быть здорово.

source: Lovely.
ru: Замечательно.

source: I was in the business part the whole time though.
ru: Я занимался делами всё время.

source: It' s wonderful you' re teaching these boys to play baseball.
ru: Это хорошо, что вы взялись обучать этих ребят игре в бейсбол.

source: It' s just a shame no one spends any time helping them to read.
ru: Но печально то, что никто не хочет помочь им в чтении.

source: Listen, I' m Conor.
ru: Послушайте, я Конор.

source: Elizabeth.
ru: Элизабет.

source: I' m only helping out with the team for two weeks... but I' m willing to get together with you and help the boys out.
ru: Я помогаю команде всего две недели... но я хочу помогать мальчикам в будущем вместе с вами.

source: - Why don' t we exchange numbers?
ru: - Почему бы нам, не обменяться телефонами?

source: - I have a better idea.
ru: - У меня есть идея получше.

source: I' il give you a copy of the book the boys are supposed to be reading.
ru: Я дам вам книгу, которую ребята должны прочесть.

source: You read it, and then you can talk to them about their reports.
ru: Вы прочтёте её, а потом поговорите с ребятами об их докладах.

source: That would be great.
ru: Это будет замечательно.

source: Conor O' Neill, coach of the crack babies.
ru: Конор Онил, тренер трудных подростков.

source: I can' t coach that team.
ru: Я не могу тренировать их.

source: I' m serious.
ru: Я серьёзно.

source: I' m bailin 'out.
ru: Я ухожу.

source: - How' d it go with the nuns?
ru: - Как у тебя дела с монашкой?

source: - God, she was beautiful.
ru: - О, она была великолепна.

source: You picked up a nun?
ru: Ты закадрил монашку?

source: You still want your half of the Blackhawks seats I got?
ru: Ты всё ещё хочешь свою половину мест на Блэккхавкс, от того, что у меня есть?

source: Where are they?
ru: Где они?

source: I' m gettin 'them tomorrow.
ru: Они будут у меня завтра.

source: Bring 'em to the baseball field on Loomis... tomorrow between 4: 00 and 5: 00.
ru: Принеси их на бейсбольное поле в Лумисе... завтра между 4. 00 и 5. 00.

source: Loomis?
ru: Лумис?

source: That' s the friggin 'projects!
ru: Это же в заднице!

source: Don' t screw me.
ru: Не зли меня.

source: I' m not in the mood.
ru: Я не в настроении.

source: - I' il be there at 5: 00.
ru: - Мне нужны эти деньги - Я буду там в 5. 00.

source: - Before 5: 00.
ru: - До 5. 00.

source: - O' Neill.
ru: - Онил.

source: Easy, slugger, all right?
ru: Спокойнее, здоровяк, хорошо?

source: You got some cabbage for me?
ru: У тебя есть хорошие новости для меня?

source: Can we talk outside, without the bat?
ru: Мы можем поговорить на улице, без свидетелей?

source: Duffy, you knew my dad.
ru: Даффи, ты знал моего отца.

source: And I wouldn' t be callin 'in a favor if I wasn' t completely racked.
ru: Меня могут повесить, если не хуже.

source: - You smashed up my bar.
ru: - Ты и так всё время пьёшь в моём баре.

source: - I' il pay you.
ru: - Я заплачу тебе.

source: I just need time.
ru: Мне просто нужно время.

source: It ain' t my money.
ru: Это были не мои деньги.

source: Now, I can' t carry you anymore.
ru: Теперь я больше не могу прикрывать тебя.

source: I' il help with the book, take bets.
ru: Я пойду к букмекерам, сделаю ставки.

source: I' il bring in business.
ru: Займусь бизнесом.

source: No, that' s not gonna work.
ru: Нет, это не сработает.

source: Listen, I gave them your name because I couldn' t carry you.
ru: Слушай, я сказал им твоё имя, потому что больше не мог покрывать тебя.

source: Are you saying some jag- off goombah is gonna come and break my thumbs?
ru: Ты рассказал этим гориллам про меня, и теперь они придут и надерут мне задницу?

source: Duffy, I' m desperate.
ru: Даффи, я в отчаянии.

source: I' m coaching a kids' baseball team... in the projects for a guy who' s paying me 500 a week.
ru: Я тренирую детскую бейсбольную команду... для парня, который платит мне 500 баксов в неделю.

source: But I' m paying the Barber off.
ru: Но я расплачиваюсь с Барбером.

source: What should I do?
ru: Что мне делать?

source: Should I tell the Barber to back off?
ru: Я должен сказать Барберу, что перестаю ему платить?

source: Start paying you every week?
ru: И начать платить тебе?

source: Keep payin 'the Barber... but don' t come around here unless you got the money.
ru: Продолжай платить Барберу... но даже не появляйся здесь до тех пор пока не достанешь деньги.

source: I' m Pearla Evans, and this one' s Kofi.
ru: Я Перла Еванс, это мой сын, Кофи.

source: This is my youngest, Jarius.
ru: А это мой младший Джариус.

source: Everybody call me G - Baby, so --
ru: Все зовут меня Джи- бэйби, так что --

source: This is my sister' s boy, Raymont.
ru: Это сын моей сестры, Рэймонт.

source: Miss Wilkes said you' re going to help with their assignments...
ru: Мисс Уилкс сказала, что вы поможете им с учёбой...

source: - so they could play ball.
ru: - так что они могут играть в бейсбол.

source: - Yeah, that was before I had this --
ru: - Да, это было до того как --

source: Miss Wilkes said she had a good feelin 'about you.
ru: Мисс Уилкс сказала, что у неё сложилось хорошее впечатление о вас.

source: - I figured I' d give it a try.
ru: - И я решила, что можно попробовать.

source: - Miss Wilkes said that?
ru: - Мисс Уилкс так сказала?

source: She said she had a good feelin 'about them all playin' ball.
ru: Она сказала, что можно позволить им тренироваться с вами.

source: - But I' il tell you now, Mr. -- - O' Neill.
ru: - Но я скажу вам мистер -- - Онил.

source: Conor O' Neill.
ru: Конор Онил.

source: You don' t help these boys, they don' t do this work... hell will be paid with your ass.
ru: Если вы не поможете им, они не будут играть... и вы заплатите за это своей задницей.

source: I can reach you at Smyth and Stevens to plan a tutoring session?
ru: Я могу позвонить, чтобы узнать о вас в Смит энд Стивенс?

source: - Good.
ru: - Хорошо.

source: - Go on, boys.
ru: - Идите, ребята.

source: - Yeah, come on!
ru: - Да, пошли!

source: Yeah, come on, man.
ru: Давай, чувак.

source: I' il beat you up, man.
ru: Я надеру тебе зад.

source: - This ain' t no giddyap show.
ru: - Это не шоу бойцов.

source: No, like this.
ru: Нет, вот так.

source: Come on, Ticky.
ru: Давай, Тикки.

source: You' re killin 'me.
ru: Ты меня убиваешь.

source: We usually quit at 5: 30.
ru: Мы обычно уходим в 5. 30.

source: Mom needs me home.
ru: Мне нужно домой, мама меня ждёт.

source: - We eat around 6: 30.
ru: - Мы ужинаем в 6. 30.

source: - No, keep practicin '.
ru: - Нет, продолжаем тренировку.

source: I' m waiting for somebody.
ru: Я кое- кого жду.

source: We' il be done soon.
ru: Мы скоро закончим.

source: - I' il let you know, Albert.
ru: - Я дам тебе знать, Альберт.

source: - I' m Jefferson.
ru: - Я Джефферсон.

source: Come on, man, pitch the ball!
ru: Давай, парень, бросай мяч!

source: - You wanna hit me?
ru: - Ты хочешь ударить меня?

source: Huh, bitch?
ru: А, парень?

source: - Oh, shit.
ru: - Вот дерьмо.

source: And if I did, what you gonna do about it, you little punk?
ru: А если ударю, что ты будешь делать, а, маленький педик?

source: Hey, that' s enough!
ru: Эй, хватит!

source: That' s enough, all right?
ru: Достаточно, ясно?

source: - Shit, I wanna see some blood.
ru: - Чёрт, я хочу пустить ему кровь.

source: - Will you guys cool it?
ru: - Остыньте.

source: Practice Saturday, 1: 00, all right?
ru: Тренировка в субботу, в 1. 00, договорились?

source: - Can I walk with you?
ru: - Можно мне пойти с вами?

source: I' m not goin 'that way.
ru: Нет, нам не по пути.

source: But --
ru: Но --

source: Yo, what' s up, my B?
ru: Йоу, в чём дело, пончик?

source: What' s up, shorty, man?
ru: В чём дело, каротышка?

source: Hey, gimme that pizza, my man.
ru: Эй, дай мне пиццу, маменькин сынок.

source: - What up, boy?
ru: - В чём дело?

source: - Open the bag.
ru: - Открой сумку.

source: Just let me go!
ru: Только отпустите меня!

source: - Let go the bag, punk.
ru: - Давай сумку, педик.

source: Thanks for the bag, fool!
ru: Спасибо за сумку, придурок!

source: I think it makes you look tough.
ru: Мне кажется, тебе не следует переживать.

source: - Is he okay?
ru: - Он в порядке?

source: I' m the coach.
ru: Я тренер.

source: Why did you keep them so late?
ru: Почему вы отпустили его так поздно?

source: Fool, I called you at Smyth and Stevens Securities... and at first, some little girl didn' t even know who you were.
ru: Послушай, идиот, я звонила в Смит энд Стивенс Секьюрити...

source: Then some man named Fleming got on the phone... and told me you were out of the office today.
ru: Потом некто Флеминг взял трубку... и сказал мне, что он в офисе сегодня.

source: Please, take my home number.
ru: Пожалуйста, запишите мой домашний номер.

source: You can' t keep them boys out there after dark.
ru: Вы не можете держать ребят до темноты.

source: Thank Jesus for Jefferson' s strength.
ru: Спасибо Иисусу за то, что Джефферсон крепкий.

source: That smell?
ru: Чем это пахнет?

source: Look at you.
ru: Посмотрите на себя.

source: You don' t even look like you' re holdin 'it together.
ru: Вы даже не похожи на того, кто бы мог собрать их вместе.

source: Jefferson, I' m sorry.
ru: Джефферсон, мне очень жаль.

source: I shoulda called practice, you know, when it got dark.
ru: Мне следовало знать, что тренировку надо было заканчивать до темноты.

source: I just came by because... as soon as you' re ready we expect you back, huh?
ru: Я пришёл чтобы сказать, что... как только ты будешь готов, мы будем ждать твоего возвращения, хорошо?

source: I needed to know what number uniform you wanted.
ru: И... я хотел бы знать, какой номер формы ты бы хотел.

source: You' re never gonna stay being our coach.
ru: Вы никогда не станете нашим тренером.

source: Enjoy the game.
ru: Наслаждайтесь игрой.

source: Nice wheels, soccer mom.
ru: Классные колёса, парень.

source: - Up yours.
ru: - Помолчи.

source: - What' s with the wagon?
ru: - Что это за тачка?

source: Smyth and Stevens took shit when a kid got beat up after practice... so they lent me this car to get 'em all home.
ru: Смит энд Стивенс дали мне это дерьмо, когда одного малыша побили после тренировки... они дали мне эту машину, чтобы я отвозил их домой.

source: Who got beat up?
ru: А кого побили- то?

source: Who needs tickets?
ru: Кому билеты?

source: - Jefferson Tibbs.
ru: - Джефферсона Тиббса.

source: - That' s the fat kid, right?
ru: - Это тот толстяк, да?

source: Yeah -- How' d you know?
ru: Да -- Откуда ты знаешь?

source: You told me about every kid on the team.
ru: Ты мне рассказывал обо всех членах команды.

source: Aw, shit.
ru: О, чёрт.

source: It' s so wrong.
ru: Господи.

source: How can I help you fellas?
ru: Чем могу помочь, парни?

source: Mister, you just sold us tickets to last night' s game.
ru: Мистер, вы только что продали нам билеты на вчерашний матч.

source: Don' t make me shoot you!
ru: Не злите меня!

source: When a man needs crack, a man needs crack!
ru: Валите отсюда, валите!

source: You' re unbelievable, man.
ru: Ты невероятен, чувак.

source: - Need seats?
ru: - Нужны места?

source: Need two?
ru: Два?

source: - How we doin 'tonight?
ru: - Как у нас сегодня дела?

source: "We"?
ru: "У нас"?

source: We aren' t doin 'so good.
ru: Не очень хорошо.

source: San Jose' s not such a hot ticket.
ru: На Сан Хосе биллеты расходятся медленно.

source: - Did the Bulls cover last night?
ru: - Быки вчера проиграли?

source: - Yeah, they won by nine.
ru: - Да, на девять очков.

source: I couldn' t get any action.
ru: Мне нужно было сделать ставку.

source: I need to find someone who' il take a big bet.
ru: Мне нужен кто- нибудь, кто примет большую ставку.

source: Fink' s minimum bet' s two grand.
ru: Финк принимает минимум две штуки.

source: - The guy at the cement plant?
ru: - Парень с цементного завода?

source: - Yeah, Fink the cement guy.
ru: - Да, Финк, цементный парень.

source: - I wanna lay 12 G' s.
ru: - Я хочу поставить 12 штук.

source: - 12 grand?
ru: - 12 штук?

source: On what?
ru: На что?

source: Since Jordan left, the Bulls have never covered at home against Miami.
ru: С тех пор как Джордан ушёл, Быки никогда не выигрывали дома против Майами.

source: - You serious about this?
ru: - Ты серьёзно?

source: - They play Miami on the 26th.
ru: - Они играют с Майами двадцать шестого.

source: - You shouldn' t do this.
ru: - Тебе не следует этого делать.

source: - I don' t have a choice.
ru: - У меня нет выбора.

source: Take me to meet Fink.
ru: Познакомь меня с Финком.

source: - Programs here!
ru: - Программы здесь!

source: I' il take you to see Fink.
ru: Я познакомлю тебя с ним.

source: Sell some tickets.
ru: Продавай билеты.

source: - Who need tickets, folks?
ru: - Кому нужны билеты?

source: - Who needs tickets?
ru: - Билеты нужны?

source: - Pay up, bitch!
ru: - Ты заплатишь за это, парень!

source: - I' il kick your ass, bitch!
ru: - Я надеру тебе задницу, говнюк!

source: Cool it!
ru: Остыньте!

source: What' s goin 'on?
ru: В чём дело?

source: Let me break it down to you right quick.
ru: Дайте, я расскажу.

source: Andre say he can catch any pop - up ball anybody can throw.
ru: Кофи сказал "Всё это дерьмо, ты врёшь".

source: Kofi say "That' s bullshit.
ru: Андрэ сказал, "Повтори, ублюдок."

source: You a busta. "
ru: Он метнул мяч.

source: Andre say, "Roll up, bitch."
ru: Андрэ поймал его.

source: Kofi say, "I' il give you all my gum if you catch this ball."
ru: Андрэ сказал, "Плати бабки."

source: He threw the ball.
ru: Он кинул мяч.

source: Andre caught it.
ru: Андрэ поймал его.

source: Andre say, "Pay me my money."
ru: Андрэ сказал, "Плати мне бабки."

source: Kofi say, "You a cheatin 'bitch." No, wait.
ru: Кофи сказал, "Ты обманул меня, говнюк." Нет, подожди.

source: - Kofi say, "You a motherf --" - Okay, I got it.
ru: - Кофи сказал, "Ты --" - Хорошо, я понял.

source: Okay, I want everybody to take a position.
ru: Я хочу, чтобы все заняли свои позиции.

source: Let' s practice.
ru: Давайте тренироваться.

source: Damn, man, you suck, just like my girlfriend.
ru: Слушай, чувак, ты отсасываешь, прямо как моя девчонка.

source: Nice catch, Andre.
ru: Хорошо ловишь, Андрэ.

source: Keep chasin ', punk.
ru: Эй ты, задница, заткнись.

source: Give me the ball.
ru: Дай мне мяч.

source: - Damn!
ru: - Чёрт!

source: Kofi just jumped out of the way like a baby!
ru: Кофи только что прыгнул как обезьяна!

source: - What' s your problem?
ru: - Да в чём дело?

source: - Why is everyone so quiet?
ru: - Почему все так притихли?

source: What' s up, Kofi?
ru: В чём дело, Кофи?

source: You scared of the ball?
ru: Ты испугался мяча?

source: New rule!
ru: Новое правило!

source: No one can say anything bad to anyone else on the field!
ru: Никто на поле ничего не говорит плохого о ком- либо другом!

source: Got it?
ru: Усвоили?

source: You can' t talk shit you got nothin 'to say?
ru: Если нельзя говорить "дерьмо", то вам больше нечего сказать?

source: Let' s hear it.
ru: Давайте попробуем.

source: Way to use your head, Jamal.
ru: Так классно используешь голову, Джамал.

source: It' s cool, Jamal, man.
ru: Это круто Джамал, чувак.

source: "Four Spanish men with hiking boots had surrounded me close.
ru: "Четверо испанцев в высоких ботинках окружили меня.

source: I could tell they were banditos because they had taco breath... and they called me 'hombre.'
ru: И они сказали мне 'омбрэ'.

source: I spun around and hit the biggest one.
ru: Я развернулся и ударил самого большого.

source: I punched him in the gut.
ru: Я пнул его в живот.

source: And as he was falling, he grabbed my backpack.
ru: И пока он падал, он схватил меня за сумку.

source: I said, 'Stop, you banditos!
ru: Я сказал, 'Остановитесь, бандиты!

source: I don' t want to have to hit anyone else. '
ru: Я не хочу больше никого бить. '

source: But because they were Spanish, they didn' t understand me.
ru: Но так как они были испанцами, они меня не поняли.

source: Two more jumped me, and I hit one of them in his -- "Between his legs.
ru: Ещё два прыгнули на меня, И я ударил одного по -- "Промеж его ног."

source: "My mouth banged on his head.
ru: "Я ударился об его голову.

source: And that was where I got my fat lip.
ru: Вот так я разбил губу.

source: The end. "
ru: Конец. "

source: - So where' d you get your fat butt?
ru: - А где ты прятал свою жирную задницу?

source: - Andre, that' s enough.
ru: - Андрэ, достаточно.

source: That was very nice, Jefferson.
ru: Очень хорошо, Джефферсон.

source: Excellent use of the first- person narrative.
ru: Отличное использование рассказа от первого лица.

source: I was scared of the banditos.
ru: Я испугалась бандитов.

source: It was good.
ru: Хорошо.

source: Okay, sit down.
ru: Садись.

source: Mr. O' Neill.
ru: Мистер Онил.

source: Fresh from the office?
ru: Прямо из офиса?

source: Why don' t you invite your pants down to your shoes so they can party?
ru: Дети, Это мистер Онил...

source: Everyone, this is Mr. O' Neill... who coaches a baseball team that some of our young men play on.
ru: Он тренирует команду, в которой некоторые из вас играют.

source: He' s taken the time out of his busy day to give us a hand.
ru: Он отвлёкся от дел, чтобы уделить нам немного времени.

source: So give him your attention.
ru: Обратите на него внимание.

source: A Wrinkle in Time is an important book... and I liked it very much.
ru: "Путешествие во времени" это очень важная книга... и она мне очень нравится.

source: I' m just sayin 'it ain' t like that.
ru: Я просто пытаюсь сказать, что это не так.

source: Fantasy ain' t reality.
ru: Фантастика не реальна.

source: I like to read stuff that' s real.
ru: Я люблю читать реальные книги.

source: - Give me an example.
ru: - На пример.

source: - Michael Jordan' s book.
ru: - Книга о Майкле Джордане.

source: - Nice book, man.
ru: - Да, это хорошая книга.

source: - Excellent choice.
ru: - Прекрасный выбор.

source: A strong piece of literature, a great read.
ru: Это важная часть литературы, книги о великих людях.

source: - That' s a biography.
ru: - Это биография.

source: That' s the real story of his life.
ru: Это реальная история о его жизни.

source: This is fiction.
ru: Это не важно.

source: The story' s made up.
ru: Историю можно подделать.

source: It' s meant to entertain you and make you think.
ru: Это поддерживает вас и заставляет вас думать.

source: Kofi, you haven' t spoken up.
ru: Кофи, ты ничего не сказал.

source: All you' ve said is you didn' t like it.
ru: Все высказали своё мнение об этой книге.

source: If you can' t say more, I' il assume that you didn' t really read it... and your mother' s gonna want me to call her.
ru: Если ты ничего не скажешь, то я могу подумать, что ты не читал её... и твоя мама захочет, чтобы я ей позвонила.

source: - Did you read the book?
ru: - Ты прочитал книгу?

source: - Tell me something about it.
ru: - Расскажи мне что- нибудь о ней.

source: I' m gonna call your mom tonight.
ru: Хорошо, я позвоню твоей маме вечером.

source: That girl Meg is dumb.
ru: Эта девочка, Мэг, была немой.

source: She think her father comin 'back from wherever.
ru: Она думала, что её отец откуда- нибудь вернётся.

source: That' s stupid to believe in.
ru: Это же глупо верить в такие вещи.

source: That girl and her mom is both trippin '.
ru: Эта девочка и её мать были ненормальные.

source: 'Cause where I' m from, don' t nobody' s father come back.
ru: Потому что там, где я живу, ничей папа ниоткуда не возвращался.

source: Come on, right here!
ru: Давай, сюда!

source: Yo, let' s do this!
ru: Давай сделаем это!

source: I' m ready to beat 'em!
ru: Я готов!

source: Hurry up!
ru: Поторопитесь!

source: Maybe this year you could turn a double play.
ru: Может в этом году получится двойная игра.

source: Got the uniforms, Coach... and your check.
ru: Возьми форму, тренер... и свой чек.

source: Can' t.
ru: - Извини, не могу.

source: Next time.
ru: Как- нибудь в другой раз.

source: Good luck today.
ru: Удачи.

source: Thanks for giving back to the community... dickhead.
ru: Спасибо за вклад в развитие общества... говнюк.

source: - I want seven like last time.
ru: - Я хочу седьмой, как в прошлый раз.

source: - I want number four!
ru: - Я хочу четвёртый номер!

source: Find a shirt that fits and put it on, okay?
ru: Найдите майки по размеру и оденьте, хорошо?

source: This shirt smells like my grandma.
ru: Эта футболка пахнет как моя бабушка.

source: Good to see you, Jefferson.
ru: Рад тебя видеть, Джефферсон.

source: - Who' s got number 11?
ru: - Кто взял номер 11?

source: - Coach, I got it here.
ru: - Тренер, вот она.

source: Jefferson, this is the biggest shirt we got, all right?
ru: Джефферсон, это самая большая, что у нас есть, хорошо?

source: Everyone, the shirts go up in sizes from two to 11, okay?
ru: Парни, берём все футболки с номерами от 2 до 11, хорошо?

source: Coach, I need a shirt.
ru: Тренер, мне нужна футболка.

source: Who' s got number ten?
ru: Кто взял номер 10?

source: - Give it to Jamal.
ru: - Отдай, Джамалу.

source: Where' s my shirt?
ru: А где моя футболка?

source: Hey, guys.
ru: Эй, парни.

source: Why don' t you guys play catch in the outfield, okay?
ru: Почему бы вам пока не размяться на поле?

source: G, hang on.
ru: Постой Джи.

source: I wanna talk to you.
ru: Я хочу поговорить с тобой.

source: - How old are you?
ru: - Сколько тебе лет?

source: - I' il be nine in October.
ru: - Мне будет девять, в октябре.

source: You' re supposed to be nine before August to play in this league.
ru: Тебе должно было исполниться девять до августа, чтобы играть в лиге.

source: But I wanna play.
ru: Но я хочу играть.

source: There' s only ten uniforms, 11 players.
ru: Только десять маек, а игроков 11.

source: So I gotta give the guys who are old enough first pick.
ru: И я вынужден отдать форму ребятам, которые старше тебя.

source: But I' m on the team, right?
ru: Но я ведь в команде, верно?
